Tekla Open API Reference for Tekla Structures 2025
DrawingEnumeratorBase.GetSize Method
 Returns the total amout of items.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int GetSize()
Public Function GetSize As Integer
Return Value
Type: Int32
The total amount of items.
See Also
Reference
DrawingEnumeratorBase Class
Tekla.Structures.Drawing Namespace